# 3️⃣ Використовуючи Set Comprehension, створи множину, яка містить лише унікальні залишки від ділення чисел 1-20 на 4.

# unic = {i for i in range(1, 21) if i % 4 ==0}
# print(unic)

# Майже правильно! Однак, у цьому завданні ми повинні створити множину залишків від ділення, а не самих чисел, які діляться на 4.
# Правильний код буде виглядати ось так:

unic = {i % 4 for i in range(1, 21)}
print(unic)

# Цей код створює множину з унікальних залишків від ділення чисел від 1 до 20 на 4.
# Результат буде:
# {0, 1, 2, 3}
# Залишки від ділення чисел на 4 можуть бути тільки такими: 0, 1, 2 та 3, тому ці значення потрапляють до множини.